Documents/ДвижениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДвижениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Биржа</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоИнвойсам</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
				<xr:Item>AccumulationRegister.Подотчет</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.ПартииВалюты</xr:Item>
				<xr:Item>AccumulationRegister.Инвестиции</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязаноИнвойсов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенег</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДКурс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДОбратный</Name>
					<Comment>Обратный расчет (от конечной суммы)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсПартии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентИнвестиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьСреднийКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инвойсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>сумма в валюте инвойса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Comment>Сумма оплаты (в валюте текущего документа)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПересчитыватьПриходТовара</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДвижениеДенег/Ext/ManagerModule.bsl
Процедура ЗаполнитьРеквизиты(Форма) Экспорт
	Форма.ИмяЖурнала = "Движения денег";
КонецПроцедуры

Процедура УстановитьВсеПараметры(Форма) Экспорт
КонецПроцедуры

Процедура ПечатьДокумента(Тек, Поз, Таб, Параметры = 0) Экспорт
КонецПроцедуры

// © Primus1C  24.05.2025  НАЧАЛО ► 

Процедура УстановитьКурсовуюРазницу(ДокументОбъект, ПоКурсуПользователя = Ложь, ТекстОшибки = Неопределено) Экспорт
	
	Если ДокументОбъект.СубДВалюта.ВестиПартионныйУчет 
		И ДокументОбъект.СубДСчет.ВестиПартионныйУчет И ДокументОбъект.Дата >= ДокументОбъект.СубДСчет.НачалоПартионногоУчета
		И ДокументОбъект.РассчитыватьСреднийКурс Тогда
		
		ДокументОбъект.СуммаКР = 0;  
		Если ДокументОбъект.СубДОбратный И ДокументОбъект.СубДКурс > 0 Тогда
			ДокументОбъект.СубДСумма = Окр(ДокументОбъект.Сумма / ДокументОбъект.СубДКурс, 2);
		Иначе
			ДокументОбъект.СубДСумма = Окр(ДокументОбъект.Сумма * ДокументОбъект.СубДКурс, 2);
		КонецЕсли;
		
		Возврат; 
		
	КонецЕсли;
	
	БазоваяВалютаФирмы = ДокументОбъект.Фирма.Валюта; // руб
	Если ДокументОбъект.Валюта = ДокументОбъект.СубДВалюта Тогда
		лКурс = 1;	  
		
	ИначеЕсли ДокументОбъект.Валюта	= БазоваяВалютаФирмы Тогда 
		лКурс = омСервер.Курс(ДокументОбъект.СубДВалюта, ДокументОбъект.Фирма, ДокументОбъект.Дата); 
		ДокументОбъект.СубДОбратный = Истина;   
		
	ИначеЕсли ДокументОбъект.СубДВалюта	= БазоваяВалютаФирмы Тогда // в руб
		лКурс = омСервер.Курс(ДокументОбъект.Валюта, ДокументОбъект.Фирма, ДокументОбъект.Дата); 
		ДокументОбъект.СубДОбратный = Ложь;   

	ИначеЕсли ДокументОбъект.СубДВалюта.БазоваяВалюта = ДокументОбъект.Валюта Тогда // пересчет покупаемой валюты в ее базовую 
		Если ДокументОбъект.СубДВалюта.ВестиПартионныйУчет И ДокументОбъект.СубДСчет.ВестиПартионныйУчет Тогда
			лКурс = омСервер.Курс(ДокументОбъект.СубДВалюта, ДокументОбъект.Фирма, ДокументОбъект.Дата, "закупка");
		Иначе
			лКурс = омСервер.Курс(ДокументОбъект.СубДВалюта, ДокументОбъект.Фирма, ДокументОбъект.Дата);
		КонецЕсли;
		//Если ДокументОбъект.СубДВалюта.ОбратныйКурс Тогда
		//	лКурс = 1 / лКурс;	
		//КонецЕсли;         
		ДокументОбъект.СубДОбратный = НЕ ДокументОбъект.СубДВалюта.ОбратныйКурс;     
		
	ИначеЕсли ДокументОбъект.Валюта.БазоваяВалюта = ДокументОбъект.СубДВалюта Тогда //
		лКурс = омСервер.Курс(ДокументОбъект.Валюта, ДокументОбъект.Фирма, ДокументОбъект.Дата);
		ДокументОбъект.СубДОбратный = ДокументОбъект.Валюта.ОбратныйКурс; 
		
	Иначе // кросс-курс
		//Кур1 = омСервер.Курс(ДокументОбъект.Валюта, 	ДокументОбъект.Фирма, ДокументОбъект.Дата);
		//Кур2 = омСервер.Курс(ДокументОбъект.СубДВалюта, ДокументОбъект.Фирма, ДокументОбъект.Дата);
        Кур1 = РаботаСВалютой.Курс(ДокументОбъект.Валюта, ДокументОбъект.Дата, ДокументОбъект.Фирма);
		Кур2 = РаботаСВалютой.Курс(ДокументОбъект.СубДВалюта, ДокументОбъект.Дата, ДокументОбъект.Фирма);
		Если Кур1 < Кур2 Тогда
			лКурс = Окр(Кур2 / Кур1, 5);
			ДокументОбъект.СубДОбратный = Истина;
		Иначе
			лКурс = Окр(Кур1 / Кур2, 5);
			ДокументОбъект.СубДОбратный = Ложь;
		КонецЕсли;    
			
	КонецЕсли;    
	
	лКурсЭталон = лКурс;
	Если ПоКурсуПользователя Тогда 
		лКурс = ДокументОбъект.СубДКурс; 
	Иначе	
		ДокументОбъект.СубДКурс = лКурс;
	КонецЕсли;
	
	Если ДокументОбъект.СубДОбратный Тогда
		ДокументОбъект.СубДСумма = Окр(ДокументОбъект.Сумма / лКурс, 2);
		СуммаЭталон = Окр(ДокументОбъект.СубДСумма * лКурсЭталон, 2);
	Иначе
		ДокументОбъект.СубДСумма = Окр(ДокументОбъект.Сумма * лКурс, 2);
		СуммаЭталон = Окр(ДокументОбъект.СубДСумма / лКурсЭталон, 2);
	КонецЕсли;
	
	ДокументОбъект.СуммаКР = СуммаЭталон - ДокументОбъект.Сумма;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
